USE RegisterCases
GO
DECLARE @t AS TABLE(id tinyint,FAM varchar(30),Im varchar(30), Ot varchar(30),DR int,COdeSMO CHAR(5),BirthDay AS DATEADD(DAY,-2,CAST(cast(DR AS datetime) AS DATE)))
INSERT @t (id,FAM,Im,Ot,DR,COdeSMO) 
VALUES (1,'Высоцкая','Ольга','Анатольевна',28084,'34002'),(2,'Никулина','Эльвира','Владиславовна',32000,'34002'),(3,'Рогозина','Надежда','Валериевна',27764,'34002'),
(4,'Щетилова','Юлия','Александровна',30257,'34002'),(5,'Суздальская','Людмила','Иосифовна',28096,'34002'),(6,'Лазарева','Софья','Сергеевна',31508,'34002'),
(7,'Сидельникова','Любовь','Александровна',29481,'34002'),(8,'Осадчая','Мария','Федоровна',32240,'34002'),(9,'Осипова','Елена','Михайловна',26198,'34002'),
(10,'Панина','Марина','Андреевна',30899,'34002'),(11,'Плотникова','Мария','Викторовна',29654,'34002'),(12,'Рожкова','Людмила','Сергеевна',29889,'34002'),
(13,'Федосова','Лариса','Владимировна',27321,'34002'),(14,'Шипкова','Зоя','Николаевна',29170,'34002'),(15,'Бериашвили','Ирина','Анатольевна',30487,'34002'),
(16,'Букарева','Татьяна','Николаевна',29033,'34002'),(17,'Водолагина','Оксана','Сергеевна',29068,'34002'),(18,'Копылова','Екатерина','Владимировна',31634,'34002'),
(19,'Ягупова','Олеся','Николаевна',31466,'34002'),(20,'Ежова','Ирина','Валентиновна',31345,'34002'),(21,'Сердюкова','Вера','Сергеевна',30904,'34001'),
(22,'Пахалова','Оксана','Сергеевна',31345,'34001'),(23,'Попова','Диляра','Илдусовна',29418,'34001'),(24,'Соловьева','Галина','Сергеевна',30818,'34001'),
(25,'Хужахметова','Татьяна','Макодесовна',30861,'34001'),(26,'Чиликина','Светлана','Анатольевна',27641,'34001'),(27,'Кригер','Лариса','Сергеевна',29680,'34001'),
(28,'Егина','Наталья','Николаевна',28240,'34001'),(29,'Кажанова','Мария','Ивановна',28998,'34001'),(30,'Лучкова','Евгения','Аликовна',28973,'34001'),
(31,'Соловьева','Яна','Вячеславовна',29450,'34001'),(32,'Украинская','Татьяна','Викторовна',30539,'34001'),(33,'Милушкина','Любовь','Владимировна',29616,'34001'),
(34,'Осипова','Татьяна','Николаевна',29210,'34001'),(35,'Османова','Людмила','Валериевна',28749,'34001'),(36,'Пухаева','Наталья','Сергеевна',28434,'34001'),
(37,'Радченко','Ксения','Александровна',28767,'34001'),(38,'Туренко','Ирина','Викторовна',29710,'34001'),(39,'Турченкова','Валентина','Михайловна',31112,'34001'),
(40,'Тыщенко','Анна','Анатольевна',28231,'34001'), (41,'Тютина','Елена','Владимировна',29998,'34001'),(42,'Фисенко','Татьяна','Александровна',30993,'34001'),
(43,'Чуватова','Дарья','Александровна',30894,'34001'),(44,'Еременко','Елена','Борисовна',28003,'34001'),(45,'Сагайдак','Людмила','Викторовна',29429,'34001'),
(46,'Саргсян','Анна','Гегамовна',29755,'34001'),(47,'Хибакина','Марина','Николаевна',28078,'34001'),(48,'Холкина','Елена','Владимировна',28005,'34001'),
(49,'Глущенко','Екатерина','Сергеевна',28718,'34001'),(50,'Краснолуцкая','Анна','Фаридовна',28910,'34001'),(51,'Матвеева','Яна','Сергеевна',30779,'34001'),
(52,'Пичугина','Наталья','Владимировна',28323,'34001'),(53,'Осина','Юлия','Николаевна',32290,'34001'),(54,'Назаренко','Лилия','Владимировна',30802,'34001'),
(55,'Попова','Диляра','Илдусовна',29418,'34001'),(56,'Сухарева','Марина','Анатольевна',31774,'34001'),(57,'Аристова','Дина','Владимировна',32320,'34001'),
(58,'Бочарникова','Татьяна','Сергеевна',30542,'34001'),(59,'Глухова','Оксана','Валерьевна',29497,'34001'),(60,'Клецкова','Татьяна','Сергеевна',30147,'34001'),
(61,'Литун','Марина','Геннадьевна',29262,'34001'),(62,'Ляшенко','Татьяна','Алексеевна',27142,'34001'),(63,'Маркова','Александра','Вячеславовна',30505,'34001'),
(64,'Павлущенко','Екатерина','Николаевна',31035,'34001'),(65,'Сенина','Светлана','Сергеевна',28347,'34001'),(66,'Урошлева','Анна','Владимировна',31182,'34001'),
(67,'Адбулвагабова','Асият','Магомедовна',32141,'34001'),(68,'Антропова','Ирина','Юрьевна',34269,'34001'),(69,'Башмак','Ольга','Владимировна',28226,'34001'),
(70,'Бутенко','Алина','Михайловна',32282,'34001'),(71,'Верхоглядова','Ксения','Игоревна',32177,'34001'),(72,'Джиоева','Юлия','Сергеевна',32537,'34001'),
(73,'Екимовских','Ольга','Владимировна',27800,'34001'),(74,'Казаченко','Инна','Викторовна',30317,'34001'),(75,'Калинова','Влада','Сергеевна',32006,'34001'),
(76,'Малиновская','Наталья','Александровна',31723,'34001'),(77,'Соловьева','Галина','Сергеевна',30818,'34001')

;WITH cases
AS 
(
SELECT t.id,a.NumberRegister,a.DateRegister,c.idRecordCase,e.ErrorNumber,e.rf_idCase
FROM dbo.t_File f INNER JOIN dbo.t_RegistersCase a ON
			f.id=a.rf_idFiles
					INNER JOIN dbo.t_RecordCase r ON
			a.id=r.rf_idRegistersCase
					INNER JOIN dbo.t_Case c ON
			r.id=c.rf_idRecordCase
					INNER JOIN dbo.t_RefRegisterPatientRecordCase rp ON
			r.id=rp.rf_idRecordCase                  
					INNER JOIN dbo.t_RegisterPatient p ON
			rp.rf_idRegisterPatient=p.id
			AND f.id=p.rf_idFiles
					INNER JOIN dbo.t_ErrorProcessControl e ON
			c.id=e.rf_idCase
			AND f.id=e.rf_idFile                  
					INNER JOIN @t t ON
			p.Fam=t.FAM
			AND p.Im=t.Im
			AND p.Ot=t.Ot
			AND p.BirthDay=t.BirthDay
WHERE f.CodeM='801934' AND f.DateRegistration>'20150701' AND f.DateRegistration<'20160101' AND a.ReportYear=2015
)
SELECT t.id,t.Fam+' '+t.Im+' '+t.Ot, t.BirthDay,t.CodeSMO,c.NumberRegister,c.DateRegister,c.idRecordCase,CAST(c.ErrorNumber AS VARCHAR(3))+' - '+e.DescriptionError
FROM cases c INNER JOIN OMS_NSI.dbo.sprAllErrors e ON
		c.ErrorNumber=e.Code 
			right JOIN @t t ON
		c.id=t.id
ORDER BY id
				

									                  
			
